uhnp/src/Documents/ОплатаМСФО/ОплатаМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаМСФО</name>
  <basedOn>Document.РеализацияМСФО</basedOn>
  <basedOn>Document.ПоступлениеМСФО</basedOn>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОплатМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>DefinedType.БанковскийСчетОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыУчетаДС</name>
    <type>
      <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНалоговМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыУчетаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ЗначенияКотировокФИ/ЗначенияКотировокФИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияКотировокФИ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>DefinedType.ТипЗначениеКотировки</types>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>DefinedType.ТипЗначениеКотировки</types>
    </type>
  </resources>
  <attributes>
    <name>КолонкаКотировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидКотировки</name>
    <type>
      <types>DefinedType.ИсточникКотировки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ВидыОплатМСФО/ВидыОплатМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОплатМСФО</name>
  <predefined>
    <items>
      <name>ВыдачаЗаймаКонтрагенту</name>
      <description>Выдача займа контрагенту</description>
    </items>
    <items>
      <name>ОплатаПокупателя</name>
      <description>Оплата покупателя</description>
    </items>
    <items>
      <name>ОплатаПоставщику</name>
      <description>Оплата поставщику</description>
    </items>
    <items>
      <name>ПереводСДругогоСчета</name>
      <description>Перевод с другого счета</description>
    </items>
    <items>
      <name>ПеречислениеЗП</name>
      <description>Перечисление заработной платы</description>
    </items>
    <items>
      <name>ПеречислениеНалога</name>
      <description>Перечисление налога</description>
    </items>
    <items>
      <name>ПолучениеЗайма</name>
      <description>Получение займа</description>
    </items>
    <items>
      <name>ПриобретениеИностраннойВалюты</name>
      <description>Приобретение иностранной валюты</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидДвижения</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентФизЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКосвенныеНалоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидимостьПараметровУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщенияISO</name>
    <type>
      <types>EnumRef.ВидыСообщенийISO20022</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/НаправленияДеятельности/НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаправленияДеятельности</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыНаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетДоходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетЗатрат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетДенежныхСредствРаздельно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетДенежныхСредствПоКорреспонденции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВнеоборотныхАктивов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДСОпределяетсяВДокументе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНаправленияДеятельности</name>
    <type>
      <types>EnumRef.ТипыНаправленийДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемФинансированияКонтракта</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаМатериалы</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаОплатуТруда</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеПроизводственныеЗатраты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщепроизводственныеЗатраты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщехозяйственныеЗатраты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческиеРасходы</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибыльКонтракта</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УправленческиеРасходы</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКредитования</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентыПоКредитам</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйКонтракт</name>
    <type>
      <types>CatalogRef.ГосударственныеКонтракты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияКонтракта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтдельногоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозмещаемыхРасходов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетРасчетовСПоставщиками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделЛицевогоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ЯвляетсяОбъектомЦБ</name>
    <comment>Выполнение задач №000042800</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДеятельности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДеятельности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопускаетсяОбособлениеСверхПотребности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлениеПризнакаДопускаетсяОбособлениеСверхПотребностиНеТребуется</name>
    <comment>Используется для обновления информационной базы</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ИдентификационныйКодЗакупки</name>
    <comment>//Ведутенко С.А. от 13.12.2023 Выполнение задач №000047803</comment>
    <type>
      <types>CatalogRef.тн_ИдентификационныеКодыЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_СБЕ</name>
    <comment>// Юдина Екатерина 19.12.2024 Выполнение задач №000052091</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Documents/ОплатаМСФО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Функция ПолучитьИменаСубконто() Экспорт

	Результат = Новый Структура;

	Субконто = Новый Соответствие;
	
	Субконто.Вставить(1, "Субконто1");
	Субконто.Вставить(2, "Субконто2");
	Субконто.Вставить(3, "Субконто3");
	Субконто.Вставить("УчетПоПодразделениям", "Подразделение");
	Субконто.Вставить("УчетПоНаправлениямДеятельности", "НаправлениеДеятельности");
	
	Результат.Вставить("РасшифровкаПлатежа", Новый Структура("ПараметрыУчетаВзаиморасчетов", Субконто));

	Возврат Результат;
	
КонецФункции

Функция ВидОперацииПоОснованию(Основание) Экспорт

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияМСФО") Тогда
		Возврат Справочники.ВидыОплатМСФО.ОплатаПокупателя;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеМСФО") Тогда
		Возврат Справочники.ВидыОплатМСФО.ОплатаПоставщику;
	Иначе 
		Возврат Справочники.ВидыОплатМСФО.ОплатаПоставщику;
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область Проведение

Функция ПодготовитьПараметрыПроведения(ДополнительныеСвойства, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	Реквизиты = МСФОУХ.РеквизитыДокумента(Запрос, "ВалютаДокумента", , Отказ);
	ДополнительныеСвойства.ДляПроведения.Вставить("Реквизиты", Реквизиты);
	
	Если Отказ Тогда
		Возврат ДополнительныеСвойства;
	КонецЕсли;
	
	РегистрыСведений.ЗначенияКотировокФИ.ЗаполнитьКроссКурсВО(Запрос, Реквизиты);
	
	Запрос.УстановитьПараметр("ГраницаДоДокумента",		МСФОВызовСервераУХ.ПолучитьГраницуДоДокумента(Реквизиты.Период, Реквизиты.Ссылка));
	Запрос.УстановитьПараметр("Организация",			Реквизиты.Организация);
	Запрос.УстановитьПараметр("Сценарий",				Реквизиты.Сценарий);
	Запрос.УстановитьПараметр("ПланСчетовМСФО", 		Реквизиты.ПланСчетовМСФО);
	Запрос.УстановитьПараметр("ФункциональнаяВалюта", 	Реквизиты.ФункциональнаяВалюта);
	Запрос.УстановитьПараметр("УчетнаяПолитика", 		Реквизиты.УчетнаяПолитика);

	ПутиСубконто = ПутиСубконто();
	
	НомераТаблиц = Новый Структура;
	ТекстЗапроса = Новый Массив;
	
	ТекстЗапроса.Добавить(ТекстЗапроса_втРасчеты(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втРасшифровкаПлатежа(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втСчетаУчета(НомераТаблиц, ПутиСубконто));
	ТекстЗапроса.Добавить(ТекстЗапроса_МСФО(НомераТаблиц, ПутиСубконто));
	
	Запрос.Текст = СтрСоединить(ТекстЗапроса, ОбщегоНазначенияУХВызовСервера.ТекстРазделителяЗапросовПакета());
	Возврат ПроведениеСерверУХ.ДополнитьТаблицамиИзПакетаЗапросов(ДополнительныеСвойства.ТаблицыДляДвижений, Запрос, НомераТаблиц);

КонецФункции

Функция ПутиСубконто()

	ПутиСубконто = Новый Соответствие;
	
	ПутиСубконто.Вставить("Справочник.Контрагенты", 	"втРасчеты.Контрагент");
	ПутиСубконто.Вставить("Справочник.БанковскиеСчета", "втРасчеты.СчетОрганизации");
	ПутиСубконто.Вставить("Документ", 					"&Ссылка");//Партия
	
	ПутиСубконто.Вставить("Справочник.СтатьиДвиженияДенежныхСредств", "втРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
	
	ПутиСубконто.Вставить("Справочник.Организации", 			"втРасшифровкаПлатежа.Подразделение");//ЦФО
	ПутиСубконто.Вставить("Справочник.НаправленияДеятельности", "втРасшифровкаПлатежа.НаправлениеДеятельности");
	
	Возврат ПутиСубконто;
	
КонецФункции

Функция ТекстЗапроса_втРасчеты(НомераТаблиц)
	
	НомераТаблиц.Вставить("втРасчеты", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.ВидОперации КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА т.ВидОперации.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Платеж)
	|		ИНАЧЕ т.ВидОперации.ВидОперации
	|	КОНЕЦ КАК ВидОперацииПроводок,
	|	т.ВидОперации.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход) КАК ЭтоПоступление,
	|	т.Контрагент КАК Контрагент,
	|	т.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА т.КурсВзаиморасчетов = 0
	|			ТОГДА 1
	|		ИНАЧЕ т.КурсВзаиморасчетов
	|	КОНЕЦ КАК КурсВД,
	|	ВЫБОР
	|		КОГДА т.КратностьВзаиморасчетов = 0
	|			ТОГДА 1
	|		ИНАЧЕ т.КратностьВзаиморасчетов
	|	КОНЕЦ КАК КратностьВД,
	|	1 КАК КурсФВ,
	|	1 КАК КратностьФВ,
	|	&КурсВО КАК КурсВО,
	|	&КратностьВО КАК КратностьВО,
	|	т.ПараметрыУчетаДС КАК ПараметрыУчетаДС,
	|	т.ПараметрыУчетаДС.СчетУчета КАК АналитикаДС,
	|	т.СчетКонтрагента КАК СчетКонтрагента,
	|	т.СчетОрганизации КАК СчетОрганизации
	|ПОМЕСТИТЬ втРасчеты
	|ИЗ
	|	Документ.ОплатаМСФО КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка";

КонецФункции

Функция ТекстЗапроса_втРасшифровкаПлатежа(НомераТаблиц)
	
	НомераТаблиц.Вставить("втРасшифровкаПлатежа", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.НомерСтроки КАК НомерСтроки,
	|	1 КАК Количество,
	|	т.СуммаПлатежа КАК СуммаПлатежа,
	|	т.СтавкаНДС КАК СтавкаНДС,
	|	т.СуммаНДС КАК СуммаНДС,
	|	т.Субконто1 КАК Субконто1,
	|	т.Субконто2 КАК Субконто2,
	|	т.Субконто3 КАК Субконто3,
	|	т.ПараметрыУчетаВзаиморасчетов КАК ПараметрыУчетаВзаиморасчетов,
	|	т.ПараметрыУчетаВзаиморасчетов.СчетУчета КАК АналитикаДКЗ,
	|	т.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	т.Подразделение КАК Подразделение,
	|	т.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ втРасшифровкаПлатежа
	|ИЗ
	|	Документ.ОплатаМСФО.РасшифровкаПлатежа КАК т
	|ГДЕ
	|	т.Ссылка В
	|			(ВЫБРАТЬ
	|				р.Ссылка
	|			ИЗ
	|				втРасчеты КАК р)";

КонецФункции

Функция ТекстЗапроса_втСчетаУчета(НомераТаблиц, ПутиСубконто)

	ПоляАналитик = 
	"втРасчеты.АналитикаДС
	|втРасшифровкаПлатежа.АналитикаДКЗ";
	
	Возврат Справочники.ПараметрыОбъектовУчетаМСФО.ТекстЗапроса_втСчетаУчета(НомераТаблиц, ПоляАналитик, ПутиСубконто);
	
КонецФункции

Функция ТекстЗапроса_МСФО(НомераТаблиц, ПутиСубконто)
	
	НомераТаблиц.Вставить("МСФО", НомераТаблиц.Количество());
	
	ТекстЗапроса = Новый Массив;
	ТекстЗапроса.Добавить(ТекстЗапроса_ПроводкаПоступлениеДС(ПутиСубконто));
	ТекстЗапроса.Добавить(ТекстЗапроса_ПроводкаСписаниеДС(ПутиСубконто));
	
	Возврат СтрСоединить(ТекстЗапроса, " ОБЪЕДИНИТЬ ВСЕ ");
	
КонецФункции

#Область Проводки

Функция ТекстЗапроса_ПроводкаПоступлениеДС(ПутиСубконто)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	втРасчеты.ВидОперации.Наименование КАК Содержание,
	|	втСчетаУчетаДт.Счет КАК СчетДт,
	|	втСчетаУчетаДт.ВидСубконто1 КАК ВидСубконтоДт1,
	|	втСчетаУчетаДт.ВидСубконто2 КАК ВидСубконтоДт2,
	|	втСчетаУчетаДт.ВидСубконто3 КАК ВидСубконтоДт3,
	|	&ДС_Субконто1 КАК СубконтоДт1,
	|	&ДС_Субконто2 КАК СубконтоДт2,
	|	&ДС_Субконто3 КАК СубконтоДт3,
	|	&ДС_Подразделение КАК ПодразделениеДт,
	|	&ДС_НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	&ДС_Количество КАК КоличествоДт,
	|	&ДС_Валюта КАК ВалютаДт,
	|	&ДС_СуммаВВалюте КАК СуммаВВалютеДт,
	|	втСчетаУчетаКт.Счет КАК СчетКт,
	|	втСчетаУчетаКт.ВидСубконто1 КАК ВидСубконтоКт1,
	|	втСчетаУчетаКт.ВидСубконто2 КАК ВидСубконтоКт2,
	|	втСчетаУчетаКт.ВидСубконто3 КАК ВидСубконтоКт3,
	|	втРасшифровкаПлатежа.Субконто1 КАК СубконтоКт1,
	|	втРасшифровкаПлатежа.Субконто2 КАК СубконтоКт2,
	|	втРасшифровкаПлатежа.Субконто3 КАК СубконтоКт3,
	|	&ДКЗ_Подразделение КАК ПодразделениеКт,
	|	&ДКЗ_НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	&ДКЗ_Количество КАК КоличествоКт,
	|	&ДКЗ_Валюта КАК ВалютаКт,
	|	&ДКЗ_СуммаВВалюте КАК СуммаВВалютеКт,
	|	&Организация КАК Организация,
	|	&Сценарий КАК Сценарий,
	|	втРасшифровкаПлатежа.СуммаПлатежа * втРасчеты.КурсВД * втРасчеты.КратностьФВ / (втРасчеты.КурсФВ * втРасчеты.КратностьВД) КАК СуммаВВалютеУчета,
	|	втРасшифровкаПлатежа.СуммаПлатежа * втРасчеты.КурсВД * втРасчеты.КратностьВО / (втРасчеты.КурсВО * втРасчеты.КратностьВД) КАК СуммаВВалютеОтчетности,
	|	втРасчеты.ВидОперацииПроводок КАК ВидОперации
	|ИЗ
	|	втРасшифровкаПлатежа КАК втРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРасчеты КАК втРасчеты
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчетаДт
	|		ПО (втРасчеты.АналитикаДС = втСчетаУчетаДт.АналитикаУчета)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчетаКт
	|		ПО втРасшифровкаПлатежа.АналитикаДКЗ = втСчетаУчетаКт.АналитикаУчета
	|ГДЕ
	|	втРасчеты.ЭтоПоступление";
	
	ФункцииЗамены = Новый Структура("Подразделение, НаправлениеДеятельности, Валюта, СуммаВВалюте, Количество", 
		"втРасшифровкаПлатежа.Подразделение", "втРасшифровкаПлатежа.НаправлениеДеятельности", "втРасчеты.ВалютаДокумента", 
		"втРасшифровкаПлатежа.СуммаПлатежа", "втРасшифровкаПлатежа.Количество");	
	
	МСФОУХ.ЗаменыСубконто(ФункцииЗамены, "втСчетаУчетаДт", ПутиСубконто);
	ЗаменыЗапроса = МСФОУХ.ЗаменыЗапросаПоПрефиксу("&ДС_");
	МСФОУХ.ЗаменитьАналитикуУчета(ТекстЗапроса, "втСчетаУчетаДт", ФункцииЗамены, ЗаменыЗапроса);

	МСФОУХ.ЗаменыСубконто(ФункцииЗамены, "втСчетаУчетаКт", ПутиСубконто);	
	ЗаменыЗапроса = МСФОУХ.ЗаменыЗапросаПоПрефиксу("&ДКЗ_");
	МСФОУХ.ЗаменитьАналитикуУчета(ТекстЗапроса, "втСчетаУчетаКт", ФункцииЗамены, ЗаменыЗапроса);
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапроса_ПроводкаСписаниеДС(ПутиСубконто)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	втРасчеты.ВидОперации.Наименование КАК Содержание,
	|	втСчетаУчетаДт.Счет КАК СчетДт,
	|	втСчетаУчетаДт.ВидСубконто1 КАК ВидСубконтоДт1,
	|	втСчетаУчетаДт.ВидСубконто2 КАК ВидСубконтоДт2,
	|	втСчетаУчетаДт.ВидСубконто3 КАК ВидСубконтоДт3,
	|	втРасшифровкаПлатежа.Субконто1 КАК СубконтоДт1,
	|	втРасшифровкаПлатежа.Субконто2 КАК СубконтоДт2,
	|	втРасшифровкаПлатежа.Субконто3 КАК СубконтоДт3,
	|	&ДКЗ_Подразделение КАК ПодразделениеДт,
	|	&ДКЗ_НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	&ДКЗ_Количество КАК КоличествоДт,
	|	&ДКЗ_Валюта КАК ВалютаДт,
	|	&ДКЗ_СуммаВВалюте КАК СуммаВВалютеДт,
	|	втСчетаУчетаКт.Счет КАК СчетКт,
	|	втСчетаУчетаКт.ВидСубконто1 КАК ВидСубконтоКт1,
	|	втСчетаУчетаКт.ВидСубконто2 КАК ВидСубконтоКт2,
	|	втСчетаУчетаКт.ВидСубконто3 КАК ВидСубконтоКт3,
	|	&ДС_Субконто1 КАК СубконтоКт1,
	|	&ДС_Субконто2 КАК СубконтоКт2,
	|	&ДС_Субконто3 КАК СубконтоКт3,
	|	&ДС_Подразделение КАК ПодразделениеКт,
	|	&ДС_НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	&ДС_Количество КАК КоличествоКт,
	|	&ДС_Валюта КАК ВалютаКт,
	|	&ДС_СуммаВВалюте КАК СуммаВВалютеКт,
	|	&Организация КАК Организация,
	|	&Сценарий КАК Сценарий,
	|	втРасшифровкаПлатежа.СуммаПлатежа * втРасчеты.КурсВД * втРасчеты.КратностьФВ / (втРасчеты.КурсФВ * втРасчеты.КратностьВД) КАК СуммаВВалютеУчета,
	|	втРасшифровкаПлатежа.СуммаПлатежа * втРасчеты.КурсВД * втРасчеты.КратностьВО / (втРасчеты.КурсВО * втРасчеты.КратностьВД) КАК СуммаВВалютеОтчетности,
	|	втРасчеты.ВидОперацииПроводок КАК ВидОперации
	|ИЗ
	|	втРасшифровкаПлатежа КАК втРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРасчеты КАК втРасчеты
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчетаДт
	|		ПО втРасшифровкаПлатежа.АналитикаДКЗ = втСчетаУчетаДт.АналитикаУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчетаКт
	|		ПО (втРасчеты.АналитикаДС = втСчетаУчетаКт.АналитикаУчета)
	|ГДЕ
	|	НЕ втРасчеты.ЭтоПоступление";
	
	ФункцииЗамены = Новый Структура("Подразделение, НаправлениеДеятельности, Валюта, СуммаВВалюте, Количество", 
		"втРасшифровкаПлатежа.Подразделение", "втРасшифровкаПлатежа.НаправлениеДеятельности", "втРасчеты.ВалютаДокумента", 
		"втРасшифровкаПлатежа.СуммаПлатежа", "втРасшифровкаПлатежа.Количество");	
	
	МСФОУХ.ЗаменыСубконто(ФункцииЗамены, "втСчетаУчетаДт", ПутиСубконто);
	ЗаменыЗапроса = МСФОУХ.ЗаменыЗапросаПоПрефиксу("&ДКЗ_");
	МСФОУХ.ЗаменитьАналитикуУчета(ТекстЗапроса, "втСчетаУчетаДт", ФункцииЗамены, ЗаменыЗапроса);

	МСФОУХ.ЗаменыСубконто(ФункцииЗамены, "втСчетаУчетаКт", ПутиСубконто);
	ЗаменыЗапроса = МСФОУХ.ЗаменыЗапросаПоПрефиксу("&ДС_");
	МСФОУХ.ЗаменитьАналитикуУчета(ТекстЗапроса, "втСчетаУчетаКт", ФункцииЗамены, ЗаменыЗапроса);
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
